; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_2 ?v7 - type_1 ?v4 - type_3)
 	      (pred_4 ?v3 - object ?v4 - type_3)
	      (pred_3 ?v7 - type_1 ?v1 - type_2)
	      (pred_1 ?v7 - type_1 ?v3 - object ?v1 - type_2))

   (:action op_1
       :parameters  (?v7 - type_1 ?v8 ?v5 - type_3)
       :precondition (and  (pred_2 ?v7 ?v8))
       :effect (and  (pred_2 ?v7 ?v5)
		     (not (pred_2 ?v7 ?v8))))

   (:action op_2
       :parameters (?v7 - type_1 ?v6 - object ?v2 - type_3 ?v1 - type_2)
       :precondition  (and  (pred_4 ?v6 ?v2) (pred_2 ?v7 ?v2) (pred_3 ?v7 ?v1))
       :effect (and (pred_1 ?v7 ?v6 ?v1)
		    (not (pred_4 ?v6 ?v2)) 
		    (not (pred_3 ?v7 ?v1))))

   (:action op_3
       :parameters (?v7 - type_1 ?v6 - object ?v2 - type_3 ?v1 - type_2)
       :precondition  (and  (pred_1 ?v7 ?v6 ?v1) (pred_2 ?v7 ?v2))
       :effect (and (pred_4 ?v6 ?v2)
		    (pred_3 ?v7 ?v1)
		    (not (pred_1 ?v7 ?v6 ?v1)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_03 obj_10 - type_1
obj_11 obj_12 obj_02 obj_07 - type_2
obj_01 obj_05 obj_08 - type_3
obj_06 obj_04 obj_09 - object)
(:init
(pred_2 obj_03 obj_01)
(pred_3 obj_03 obj_11)
(pred_3 obj_03 obj_12)
(pred_2 obj_10 obj_01)
(pred_3 obj_10 obj_02)
(pred_3 obj_10 obj_07)
(pred_4 obj_06 obj_01)
(pred_4 obj_04 obj_05)
(pred_4 obj_09 obj_01)
)
(:goal
(and
(pred_4 obj_06 obj_05)
(pred_4 obj_04 obj_08)
(pred_4 obj_09 obj_01)
)
)

(:constraints
  (always (not (pred_2 obj_03 obj_08)))
)
)

; plan
1. (op_2 obj_03 obj_06 obj_01 obj_12)
   deleted: (pred_4 obj_06 obj_01) (pred_3 obj_03 obj_12)
   added: (pred_1 obj_03 obj_06 obj_12)
   goals met: 1 of 3
2. (op_1 obj_10 obj_01 obj_05)
   deleted: (pred_2 obj_10 obj_01)
   added: (pred_2 obj_10 obj_05)
   goals met: 1 of 3
3. (op_1 obj_03 obj_01 obj_05)
   deleted: (pred_2 obj_03 obj_01)
   added: (pred_2 obj_03 obj_05)
   goals met: 1 of 3
4. (op_2 obj_03 obj_04 obj_05 obj_11)
   deleted: (pred_4 obj_04 obj_05) (pred_3 obj_03 obj_11)
   added: (pred_1 obj_03 obj_04 obj_11)
   goals met: 1 of 3
5. (op_3 obj_03 obj_06 obj_05 obj_12)
   deleted: (pred_1 obj_03 obj_06 obj_12)
   added: (pred_4 obj_06 obj_05) (pred_3 obj_03 obj_12)
   goals met: 2 of 3
6. (op_3 obj_03 obj_04 obj_05 obj_11)
   deleted: (pred_1 obj_03 obj_04 obj_11)
   added: (pred_4 obj_04 obj_05) (pred_3 obj_03 obj_11)
   goals met: 2 of 3
7. (op_2 obj_10 obj_04 obj_05 obj_07)
   deleted: (pred_4 obj_04 obj_05) (pred_3 obj_10 obj_07)
   added: (pred_1 obj_10 obj_04 obj_07)
   goals met: 2 of 3
8. (op_1 obj_10 obj_05 obj_08)
   deleted: (pred_2 obj_10 obj_05)
   added: (pred_2 obj_10 obj_08)
   goals met: 2 of 3
9. (op_3 obj_10 obj_04 obj_08 obj_07)
   deleted: (pred_1 obj_10 obj_04 obj_07)
   added: (pred_4 obj_04 obj_08) (pred_3 obj_10 obj_07)
   goals met: 3 of 3
